<!-- ■ トップページ【front-page.php】 -->    
<?php

  // 
  // *******************************************************
  // *******************************************************
  // ★ 【global：グローバル変数】の取込み
  // *******************************************************
  // *******************************************************
  get_template_part( 'WaPlusCfg/commpn-php/globalVariables' );

  // // 
  // // 当該固定ページ種別設定
  // global $GB_menuPos;
  // global $GB_page_flag;

  // // 
  // // 単一セクションに表示する投稿タイルの数
  // global $GB_countOfPosts;

  // //
  // // 表示する投稿の種別「カテゴリー」
  // global $GB_categoryType;

  // 表示対象ページ・メニュー種別
  $GB_menuPos     = 0;    // front-page：0
  // ホームページ内遷移動作制御フラグ
  $GB_page_flag   = 0;  
  // 単一セクションに表示する投稿タイルの数
  $GB_countOfPosts = 3;

  // 表示する投稿の種別「カテゴリー」
  $GB_categoryType = "news";

  // 
  // // 【WordPress・get_header】用引数設定
  // $params       = [ 'GB_menuPos'      => $GB_menuPos,
  //                   'GB_page_flag'    => $GB_page_flag,
  //                   'GB_categoryType' => $GB_categoryType
  //                 ]; 

  // ヘッダー部の取込み
  // get_header( null, $params );
  get_header( null );
?>

    <!--  -->
    <!-- サイトトップページ・メインコンテンツ -->
    <div class="main" id="mainArea">

      <?php
        // 
        // *******************************************************
        // *******************************************************
        // ★ 【株式会社和Plus ご提供サービス・事業説明セクション】の取込み
        // *******************************************************
        // *******************************************************
        // get_template_part( 'WaPlusCfg/contents/00_index/01_pageTopSection', null, $params );
        get_template_part( 'WaPlusCfg/contents/00_index/01_pageTopSection' );


        // 
        // *******************************************************
        // *******************************************************
        // ★ 【株式会社和Plus ご提供サービス・事業説明セクション】の取込み
        // *******************************************************
        // *******************************************************
        // get_template_part( 'WaPlusCfg/contents/00_index/02_ourServicesSection', null, $params );
        get_template_part( 'WaPlusCfg/contents/00_index/02_ourServicesSection' );
      ?>

      <!-- ****************************************************** -->
      <!-- ■■■■■ 横スクロールブロック ■■■■■ -->
      <!-- ****************************************************** -->
      <section id="sideScrollArea">
        <div class="sideScrollArea js-sideScrollArea">
          <div class="allPanelWrapper js-allPanelWrapper">

            <?php
              // 
              // *******************************************************
              // *******************************************************
              // ★ 【株式会社和Plus 経営支援事業 説明セクション】の取込み
              // *******************************************************
              // *******************************************************
              // get_template_part( 'WaPlusCfg/contents/00_index/03-01_managmentSupport', null, $params );
              get_template_part( 'WaPlusCfg/contents/00_index/03-01_managmentSupport' );
            ?>

            <?php
              // 
              // *******************************************************
              // *******************************************************
              // ★ 【株式会社和Plus IT WEB ソリューション 事業説明セクション】の取込み
              // *******************************************************
              // *******************************************************
              // get_template_part( 'WaPlusCfg/contents/00_index/03-02_itWebSolution', null, $params );
              get_template_part( 'WaPlusCfg/contents/00_index/03-02_itWebSolution' );
            ?>

            <?php
              // 
              // *******************************************************
              // *******************************************************
              // ★ 【株式会社和Plus オリジナル商品販売 大人の素敵雑貨 事業説明セクション】の取込み
              // *******************************************************
              // *******************************************************
              // get_template_part( 'WaPlusCfg/contents/00_index/03-03_i-nekka', null, $params );
              get_template_part( 'WaPlusCfg/contents/00_index/03-03_i-nekka' );
            ?>

            <?php
              // 
              // *******************************************************
              // *******************************************************
              // ★ 【株式会社和Plus オリジナル商品販売 クロコダイルアイテム 事業説明セクション】の取込み
              // *******************************************************
              // *******************************************************
              // get_template_part( 'WaPlusCfg/contents/00_index/03-04_ACestus', null, $params );
              get_template_part( 'WaPlusCfg/contents/00_index/03-04_ACestus' );
            ?>

          </div>
        </div>  
      </section>
<!-- ****************************************************** -->
<!-- ****************************************************** -->
<!-- ****************************************************** -->

      <?php
        // 
        // *******************************************************
        // *******************************************************
        // ★ 【株式会社和Plus 新着ニュース・ブログ/日々活動 一覧 セクション】の取込み
        // *******************************************************
        // *******************************************************
        // get_template_part( 'WaPlusCfg/contents/00_index/04_ourInformations', null, $params );
        get_template_part( 'WaPlusCfg/contents/00_index/04_ourInformations' );
        ?>

    </div>    <!-- main -->

<!-- **************************************************************** -->
<!-- **************************************************************** -->
<!-- **************************************************************** -->
<?php 
  // フッター部の取込み
  // get_footer( null, $params );
  get_footer( null );
?>
<!-- **************************************************************** -->
<!-- **************************************************************** -->
<!-- **************************************************************** -->