<?php
  // echo " >>>>> get_theme_file_path( " . get_theme_file_path() . ") ";
  // 
  // *******************************************************
  // *******************************************************
  // ★ WORDPRESS 基本設定
  // *******************************************************
  // *******************************************************
  function my_setup(){
    add_theme_support('post-thumbnails');       // アイキャッチ画像を有効化
    add_theme_support('automatic-feed-links');  // 投稿とコメントのRSSフィードのリンクを有効化
    add_theme_support('title-tag');             // titleタグ自動生成
    add_theme_support('html5', array(           // HTML5による出力
      'search-form',
      'comment-form',
      'comment-list',
      'gallery',
      'caption',
    ));
  }
  add_action('after_setup_theme', 'my_setup');

	//
	// ********************************************************
	// ********************************************************
	// ■ 当該テーマでの「アイキャッチ画像をサポート」する為の定義
	// ********************************************************
	add_action( 'init', function() {
		add_theme_support( 'post-thumbnails' );
	});
	// ********************************************************
	// ********************************************************

  // 
  // *******************************************************
  // ★ WORDPRESS フロント：ブロックエディタ用CSSの追加
  // *******************************************************
  add_action( 'after_setup_theme', function() {
    // ブロックエディタ用スタイル機能をテーマに追加
    add_theme_support( 'editor-styles' );
    // ブロックエディタ用CSSの読み込み
    add_editor_style( get_template_directory() . '/WaPlusCfg/assets/scss/common-style/archive/forWordPressEditor.min.css' );
  });

  // 
  // *******************************************************
  // *******************************************************
  // ★ モバイル or パソコン判定
  // *******************************************************
  // *******************************************************
  // require_once get_theme_file_path( '/WaPlusCfg/common-php/Mobile_Detect.php' );
  require_once( get_template_directory() . '/WaPlusCfg/common-php/Mobile_Detect.php' );

  // 
  // *******************************************************
  // *******************************************************
  // ★ 当該ＷＥＢサイト内利用グローバル定義
  // *******************************************************
  // *******************************************************
  require_once( get_template_directory() . '/WaPlusCfg/common-php/globalVariablesDef.php' );

  // 
  // *******************************************************
  // *******************************************************
  // ★ 【JavaScriptファイル】の取込み
  // *******************************************************
  // *******************************************************
  // require_once get_theme_file_path( '/WaPlusCfg/common-php/myJavaScript.php' );
  require_once( get_template_directory() . '/WaPlusCfg/common-php/myJavaScript.php' );

  // 
  // *******************************************************
  // *******************************************************
  // ★ 【独自スタイルシート】の取込み
  // *******************************************************
  // *******************************************************
  // require_once get_theme_file_path( '/WaPlusCfg/common-php/myStyleSheet.php' );
  require_once( get_template_directory() . '/WaPlusCfg/common-php/myStyleSheet.php' );
  
  // 
  // *******************************************************
  // *******************************************************
  // ★ 【投稿】のアーカイブページ「archive.php」を作成する
  //   （WordPress デフォルト設定では、非表示に成っている為）
  // 
  // 【参考】「https://otamunote.com/wp-post-archive/」
  // *******************************************************
  // *******************************************************
  function post_has_archive($args, $post_type)
  {
      if ('post' == $post_type) {
          $args['rewrite']     =  true;  // リライトを有効にする
          $args['has_archive'] = 'archive'; // 任意のスラッグ名
      }
      return $args;
  }
  add_filter('register_post_type_args', 'post_has_archive', 10, 2);

  // 
  // *******************************************************
  // *******************************************************
  // ★ 【投稿一覧：fron-page.php】クリックからの、
  //  　【投稿個別ページ：single.php】へのURL内引数「.../?p=ID」、
  //  　【p=ID】の「#ID」を取得する為の設定「value = $_GET('p');も可」。
  //  　※ 本来は、自分で自由に「URL内引数を設定」し値を取得出来る様にするもの
  // 
  // 【参考】「https://rensrv.com/wp/query_string_add/」 
  // 
  // ★ 「URL内引数」の取得には、
  //   【value = get_query_var('ユーザー定義変数');】にて取得可能
  // if(get_query_var('test_cat')=='test-a'){
  //   処理１： http://domain.com/xxx/?test_cat=test-a のときの挙動を記述
  // }else{
  //   処理２： http://domain.com/xxx/?test_cat=test-a ではないときの挙動を記述
  // }
  // *******************************************************
  // *******************************************************
  function add_query_vars_filter( $vars ){
    $vars[] = "p";          // ユーザー定義変数
    return $vars;
  }
  add_filter( 'query_vars', 'add_query_vars_filter' );

  // 
  // *******************************************************************************
  // *******************************************************************************
  // *******************************************************************************
  // *******************************************************************************
  // *******************************************************************************  
	//   
	// グローバル変数定義ファイル
  require( get_template_directory() . '/WaPlusCfg/common-php/globalVariables.php' );

  // 
  // *******************************************************
  // *******************************************************
  // ★ 投稿ページ：カテゴリー表示関連関数群
  // *******************************************************
  // *******************************************************
  require_once( get_template_directory() . '/WaPlusCfg/common-php/categoryUtility/categoryPaginationCtr.php' );

  // 
  // *******************************************************
  // *******************************************************
  // ★ 投稿一覧ページ：カテゴリーページ内表示件数変更関数
  //  》ＰＣでの一覧表示時　　　　　　：wordpress初期値「５」
  //  》モバイルデバイスでの一覧表示時：当関数での変更値「３」
  // *******************************************************
  // *******************************************************
  function change_posts_per_page($query) {
  
    // 
    //管理画面及びメインクエリ以外に影響させない。
    if ( is_admin() || !$query->is_main_query() )  { return; }

    // 
    // モバイルデバイス表示時は、
    // 一覧表示件数を「５」から「３」に変更
    if ( wp_is_mobile() )  {
      //ページあたりの表示件数を3件にする。
      $query->set( 'posts_per_page', '3' );
      return;
    }
  }
  add_action( 'pre_get_posts', 'change_posts_per_page' );

  // 
  // *******************************************************
  // *******************************************************
  // ★ カスタム投稿タイプの追加
  // *******************************************************
  // *******************************************************
// function create_post_type() {
//   register_post_type( 'news', // 投稿タイプ名の定義
//     array(
//       'labels'        => array(
//         'name'          => __( '■ 新着情報' ), // 表示する投稿タイプ名
//         'singular_name' => __( '■ 新着情報' ) ),
//       'public'        => true,
//       'menu_position' => 5,
//     )
//   );
// }
// add_action( 'init', 'create_post_type' );

  // 
  // GoogleSearchConsole でのリダイレクトエラー防止策 
  //旧スラッグからの自動補完リダイレクトを停止
  remove_action( 'template_redirect', 'wp_old_slug_redirect' );
?>